mysensors-rus/nRF5-SDK-for-Thread-and-Zigbee-3.1/examples/zigbee/ota/experimental_server/main.c
/**
 * Copyright (c) 2018 - 2019, Nordic Semiconductor ASA
 *
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *
 * 1. Redistributions of source code must retain the above copyright notice, this
 *    list of conditions and the following disclaimer.
 *
 * 2. Redistributions in binary form, except as embedded into a Nordic
 *    Semiconductor ASA integrated circuit in a product or a software update for
 *    such product, must reproduce the above copyright notice, this list of
 *    conditions and the following disclaimer in the documentation and/or other
 *    materials provided with the distribution.
 *
 * 3. Neither the name of Nordic Semiconductor ASA nor the names of its
 *    contributors may be used to endorse or promote products derived from this
 *    software without specific prior written permission.
 *
 * 4. This software, with or without modification, must only be used with a
 *    Nordic Semiconductor ASA integrated circuit.
 *
 * 5. Any software provided in binary form under this license must not be reverse
 *    engineered, decompiled, modified and/or disassembled.
 *
 * THIS SOFTWARE IS PROVIDED BY NORDIC SEMICONDUCTOR ASA "AS IS" AND ANY EXPRESS
 * OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
 * OF MERCHANTABILITY, NONINFRINGEMENT, AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL NORDIC SEMICONDUCTOR ASA OR CONTRIBUTORS BE
 * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
 * CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE
 * GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
 * HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT
 * OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 *
 */
/** @file
 *
 * @defgroup zigbee_examples_ota_server main.c
 * @{
 * @ingroup zigbee_examples
 * @brief OTA Server example to be used with the nrfutil dfu zigbee command or as a standalone app.
 *
 * @details The application assumes that a correct OTA Upgrade file is located at the UPGRADE_IMAGE_OFFSET
 *          location. After the start the server try to commission itself to the Zigbee Network and after
 *          5 seconds starts disseminating the update.
 *          When compiled with ZIGBEE_OTA_SERVER_USE_CLI flag, the CLI interface is added - it is needed
 *          when using the server with the nrfutil (the nrfutil then explicitly uses the 'zdo channel' and
 *          'bdb start' commands to begin the commissioning).
 */

#include "zboss_api.h"
#include "zb_mem_config_med.h"
#include "zb_error_handler.h"
#include "zigbee_helpers.h"

#include "app_timer.h"
#include "nrf_drv_clock.h"
#include "app_scheduler.h"
#include "nrf_dfu_utils.h"
#include "nrf_dfu_transport.h"
#include "nrf_bootloader_info.h"
#include "nrf_dfu_settings.h"
#include "nrf_dfu_req_handler.h"
#include "nrf_dfu_validation.h"
#include "nrf_dfu_ver_validation.h"
#include "nrf_drv_power.h"

#include "boards.h"

#include "nrf_log.h"
#include "nrf_log_ctrl.h"
#include "nrf_log_default_backends.h"

#include "ota_upgrade_server.h"

#ifdef SOFTDEVICE_PRESENT
#include "nrf_dfu_ble.h"
#endif

#ifdef SOFTDEVICE_PRESENT
#include "nrf_dfu_ble.h"
#endif

#define SCHED_QUEUE_SIZE      64                                                /**< Maximum number of events in the scheduler queue. */
#define SCHED_EVENT_DATA_SIZE MAX((sizeof(nrf_dfu_request_t)), APP_TIMER_SCHED_EVENT_DATA_SIZE) /**< Maximum app_scheduler event size. */

#if defined(ZIGBEE_OTA_SERVER_USE_CLI) && (ZIGBEE_OTA_SERVER_USE_CLI == 1)
#include "zigbee_cli.h"
#endif

#if ! defined ZB_ROUTER_ROLE
#error define ZB_ROUTER_ROLE to compile OTA Server
#endif

#define MAX_CHILDREN                      10                                    /**< The maximum amount of connected devices. Setting this value to 0 disables association to this device.  */
#define IEEE_CHANNEL_MASK                 (1l << ZIGBEE_CHANNEL)                /**< Scan only one, predefined channel to find the coordinator. */
#ifdef SOFTDEVICE_PRESENT
#define ERASE_PERSISTENT_CONFIG           ZB_FALSE                              /**< Do no erase NVRAM. Keep the network parameters after device reboot or power-off. */
#else
#define ERASE_PERSISTENT_CONFIG           ZB_TRUE                               /**< Erase NVRAM to reset the network parameters after device reboot or power-off. */
#endif
#define ZIGBEE_NETWORK_STATE_LED          BSP_BOARD_LED_2                       /**< LED indicating that OTA Server successfully joined ZigBee network. */
#define OTA_IMAGE_PRESENT_LED             BSP_BOARD_LED_3                       /**< LED indicating that a correct OTA Upgrade file is present. */
#define BLE_OTA_ACTIVITY_LED              BSP_BOARD_LED_3                       /**< LED indicating that a new image is transferred through BLE. */
#define ZIGBEE_OTA_IMAGE_NOTIFY_DELAY     ZB_MILLISECONDS_TO_BEACON_INTERVAL(5 * 1000) /**< Additional delay, in beacon intervals between device startup, if correct image was found inside flash memory, and sending Zigbee Image Notify message. */

#define OTA_ENDPOINT                      5
#if defined(ZIGBEE_OTA_SERVER_USE_CLI) && (ZIGBEE_OTA_SERVER_USE_CLI == 1)
#define CLI_AGENT_ENDPOINT                64                                    /**< Source endpoint used to control light bulb. */
#endif

#ifndef SOFTDEVICE_PRESENT
#define UPGRADE_IMAGE_OFFSET              0x80000                               /**< The address inside flash, were Zigbee image is stored. This value has to be aligned with nrfutil constant (OTA_UPDATE_OFFSET inside OTAFlasher class). */
#else
#define UPGRADE_IMAGE_OFFSET              nrf_dfu_bank1_start_addr()            /**< The address inside flash, were Zigbee image is stored. By default BLE DFU stores images inside BANK1, which address depends on the server application size */
#endif

#define NUMBER_OF_UPGRADE_IMAGES          1
#define OTA_UPGRADE_TEST_CURRENT_TIME     0x00000000                            /**< Server does not support Time cluster, use OTA_UPGRADE_TEST_UPGRADE_TIME as delay value. */
#ifndef OTA_UPGRADE_TEST_UPGRADE_TIME
#define OTA_UPGRADE_TEST_UPGRADE_TIME     0x00000001                            /**< If OTA_UPGRADE_TEST_CURRENT_TIME set to zero, use this value as firmware upgrade delay in seconds. */
#endif


typedef struct
{
    zb_uint8_t zcl_version;
    zb_uint8_t power_source;
} ota_server_basic_attr_t;

typedef struct
{
    zb_uint8_t  query_jitter;
    zb_uint32_t current_time;
} ota_server_ota_upgrade_attr_t;

typedef struct
{
    ota_server_basic_attr_t       basic_attr;
    ota_server_ota_upgrade_attr_t ota_attr;
} ota_server_ctx_t;

typedef ZB_PACKED_PRE struct ota_upgrade_test_file_s
{
  zb_zcl_ota_upgrade_file_header_t head;
  zb_uint8_t data[1];
} ZB_PACKED_STRUCT ota_upgrade_test_file_t;

static zb_bool_t                 m_stack_started = ZB_FALSE;
static ota_upgrade_test_file_t * mp_ota_file = NULL;
#ifdef SOFTDEVICE_PRESENT
static bool m_ota_file_inserted  = false;
static bool m_external_app_valid = false;
#endif
/******************* Declare attributes ************************/

static ota_server_ctx_t m_dev_ctx;

