mysensors-rus/nRF5-SDK-for-Thread-and-Zigbee-3.1/examples/zigbee/ota/experimental_server/main.c
ZB_ZCL_DECLARE_BASIC_ATTRIB_LIST(basic_attr_list,
                                 &m_dev_ctx.basic_attr.zcl_version,
                                 &m_dev_ctx.basic_attr.power_source);

ZB_ZCL_DECLARE_OTA_UPGRADE_ATTRIB_LIST_SERVER(ota_upgrade_attr_list,
                                              &m_dev_ctx.ota_attr.query_jitter,
                                              &m_dev_ctx.ota_attr.current_time,
                                              NUMBER_OF_UPGRADE_IMAGES);

/********************* Declare device **************************/

ZB_HA_DECLARE_OTA_UPGRADE_SERVER_CLUSTER_LIST(ota_upgrade_server_clusters,
                                              basic_attr_list,
                                              ota_upgrade_attr_list);

ZB_HA_DECLARE_OTA_UPGRADE_SERVER_EP(ota_upgrade_server_ep, OTA_ENDPOINT, ota_upgrade_server_clusters);

#if defined(ZIGBEE_OTA_SERVER_USE_CLI) && (ZIGBEE_OTA_SERVER_USE_CLI == 1)
static zb_uint16_t m_attr_identify_time = 0;

/* Declare attribute list for Identify cluster. */
ZB_ZCL_DECLARE_IDENTIFY_ATTRIB_LIST(identify_attr_list, &m_attr_identify_time);

/* Declare cluster list for CLI Agent device. */
/* Only clusters Identify and Basic have attributes. */
ZB_HA_DECLARE_CONFIGURATION_TOOL_CLUSTER_LIST(cli_agent_clusters,
                                              basic_attr_list,
                                              identify_attr_list);

/* Declare endpoint for CLI Agent device. */
ZB_HA_DECLARE_CONFIGURATION_TOOL_EP(cli_agent_ep,
                                    ZIGBEE_CLI_ENDPOINT,
                                    cli_agent_clusters);

/* Declare application's device context (list of registered endpoints) for CLI Agent device. */
ZB_HA_DECLARE_CONFIGURATION_TOOL_CTX(cli_agent_ctx, cli_agent_ep);

ZBOSS_DECLARE_DEVICE_CTX_2_EP(ota_upgrade_server_ctx, ota_upgrade_server_ep, cli_agent_ep);
#else /* defined(ZIGBEE_OTA_SERVER_USE_CLI) && (ZIGBEE_OTA_SERVER_USE_CLI == 1) */
ZB_HA_DECLARE_OTA_UPGRADE_SERVER_CTX(ota_upgrade_server_ctx, ota_upgrade_server_ep);
#endif /* defined(ZIGBEE_OTA_SERVER_USE_CLI) && (ZIGBEE_OTA_SERVER_USE_CLI == 1) */

#ifdef SOFTDEVICE_PRESENT
/* Forward declaration of functions controlling BLE DFU transport. */
uint32_t ble_dfu_transport_init(nrf_dfu_observer_t observer);
uint32_t ble_dfu_transport_close(nrf_dfu_transport_t const * p_exception);
#endif

/**@brief Function for the Timer initialization.
 *
 * @details Initializes the timer module. This creates and starts application timers.
 */
static void timers_init(void)
{
    ret_code_t err_code;

    // Initialize timer module.
    err_code = app_timer_init();
    APP_ERROR_CHECK(err_code);
}

/**@brief Function for initializing the nrf log module.
 */
static void log_init(void)
{
    ret_code_t err_code = NRF_LOG_INIT(NULL);
    APP_ERROR_CHECK(err_code);

    NRF_LOG_DEFAULT_BACKENDS_INIT();
}

/**@brief Function for initializing scheduler module.
 */
static void scheduler_init(void)
{
    APP_SCHED_INIT(SCHED_EVENT_DATA_SIZE, SCHED_QUEUE_SIZE);
}

/**@brief Function for initializing the Power Driver.
 */
static void power_driver_init(void)
{
    ret_code_t err_code;
    err_code = nrf_drv_power_init(NULL);
    APP_ERROR_CHECK(err_code);
}

/**@brief Function for initializing all clusters attributes.
 */
static void ota_server_attr_init(void)
{
    /* Basic cluster attributes data */
    m_dev_ctx.basic_attr.zcl_version  = ZB_ZCL_VERSION;
    m_dev_ctx.basic_attr.power_source = ZB_ZCL_BASIC_POWER_SOURCE_UNKNOWN;

    /* OTA cluster attributes data */
    m_dev_ctx.ota_attr.query_jitter = ZB_ZCL_OTA_UPGRADE_QUERY_JITTER_MAX_VALUE;
    m_dev_ctx.ota_attr.current_time = OTA_UPGRADE_TEST_CURRENT_TIME;
}

/**@brief This callback is called on next image block request
 *
 * @param index  file index
 * @param offset current offset of the file
 * @param size   block size
 */
static zb_uint8_t * next_data_ind_cb(zb_uint8_t index, zb_uint32_t offset, zb_uint8_t size)
{
    return ((zb_uint8_t *)mp_ota_file + offset);
}

/**@brief Function for checking if a new Zigbee image is present at given address.
 *
 * @params[in] p_ota_file  Pointer to the memory, where Zigbee OTA image starts.
 *
 * @returns true if a valid image is found, false otherwise.
 */
static bool ota_file_sanity_check(ota_upgrade_test_file_t * p_ota_file)
{
    if (p_ota_file->head.file_id != ZB_ZCL_OTA_UPGRADE_FILE_HEADER_FILE_ID)
    {
        bsp_board_led_off(OTA_IMAGE_PRESENT_LED);
        return false;
    }
    else
    {
        bsp_board_led_on(OTA_IMAGE_PRESENT_LED);
        return true;
    }
}

static zb_void_t insert_ota_file(zb_uint8_t param)
{
    zb_buf_t * buf = (zb_buf_t *)ZB_BUF_FROM_REF(param);
    /* The function assumes that at the UPGRADE_IMAGE_OFFSET address the correct OTA upgrade file can be found */
    ZB_ZCL_OTA_UPGRADE_INSERT_FILE(buf, OTA_ENDPOINT, 0, (zb_uint8_t *)(mp_ota_file), OTA_UPGRADE_TEST_UPGRADE_TIME);
#ifdef SOFTDEVICE_PRESENT
    m_ota_file_inserted = true;
#endif
}

#ifdef SOFTDEVICE_PRESENT
static zb_void_t remove_ota_file(zb_uint8_t param)
{
    if (!m_ota_file_inserted)
    {
        return;
    }

    zb_buf_t * buf = (zb_buf_t *)ZB_BUF_FROM_REF(param);
    ZB_ZCL_OTA_UPGRADE_REMOVE_FILE(buf, OTA_ENDPOINT, 0);
    m_ota_file_inserted = false;
}

/**@brief Function for reseting the OTA server. After update, the background DFU
 *        bootloader will apply the new firmware.
 *
 * @param[in]   param   Not used. Required by callback type definition.
 */
static zb_void_t reset_ota_server(zb_uint8_t param)
{
    if (param)
    {
        ZB_FREE_BUF_BY_REF(param);
    }

    NRF_LOG_FINAL_FLUSH();
    NVIC_SystemReset();
}

/**@brief Function for handling a self-upgrade DFU process.
 *
 * @details Cannot close transport directly form event context, as it is called
 *          directly from softdevice event and disabling softdevice (by closing
 *          BLE transport) in an softdevice-interrupt context is prohibited.
 **/
static void ble_transport_disable(void * p_event_data, uint16_t event_size)
{
    UNUSED_PARAMETER(p_event_data);
    UNUSED_PARAMETER(event_size);

