mysensors-rus/nRF5-SDK-for-Thread-and-Zigbee-3.1/examples/zigbee/ota/experimental_server/main.c
    UNUSED_RETURN_VALUE(ble_dfu_transport_close(NULL));
}

/**@brief Function notifies certain events in DFU process. */
static void dfu_observer(nrf_dfu_evt_type_t event)
{
    static bool dfu_image_valid      = false;
    static bool ble_transport_active = false;
    zb_ret_t    zb_err_code;

    switch (event)
    {
        case NRF_DFU_EVT_TRANSPORT_DEACTIVATED:
            if (ota_file_sanity_check(mp_ota_file))
            {
                NRF_LOG_INFO("BLE peer successfully disconnected.");
            }
            else
            {
                NRF_LOG_INFO("BLE transport deactivated.");
                ble_transport_active = false;

                if (dfu_image_valid)
                {
                    NRF_LOG_INFO("New firmware for OTA server accepted. Reset device.");
                    UNUSED_RETURN_VALUE(ZB_SCHEDULE_CALLBACK(reset_ota_server, 0));
                }
            }
            break;

        case NRF_DFU_EVT_DFU_INITIALIZED:
            break;

        case NRF_DFU_EVT_TRANSPORT_ACTIVATED:
            ble_transport_active = true;
            break;

        case NRF_DFU_EVT_DFU_STARTED:
            NRF_LOG_INFO("BLE image transfer started.");
            NRF_LOG_INFO("Store new image at 0x%08x", mp_ota_file);

            // A new Zigbee image is going to be transferred over BLE and will overwrite current image contents.
            // Invalidate current image, so any ongoing Zigbee DFU process will be aborted by OTA server.
            zb_err_code = ZB_GET_OUT_BUF_DELAYED(remove_ota_file);
            ZB_ERROR_CHECK(zb_err_code);

            bsp_board_led_on(BLE_OTA_ACTIVITY_LED);
            dfu_image_valid = false;
            break;

        case NRF_DFU_EVT_OBJECT_RECEIVED:
            bsp_board_led_invert(BLE_OTA_ACTIVITY_LED);
            break;

        case NRF_DFU_EVT_DFU_FAILED:
        case NRF_DFU_EVT_DFU_ABORTED:
            NRF_LOG_WARNING("BLE image transfer stopped with errors. Reason: %d.", event);
            bsp_board_led_off(BLE_OTA_ACTIVITY_LED);
            break;

        case NRF_DFU_EVT_DFU_COMPLETED:
            NRF_LOG_INFO("BLE image transferred completed. Zigbee image: %s", (ota_file_sanity_check(mp_ota_file) ? "true" : "false"));

            // Check if Zigbee image was received.
            if (ota_file_sanity_check(mp_ota_file))
            {
                if (!m_external_app_valid)
                {
                    NRF_LOG_INFO("New Zigbee image dropped due to previous validation failures.");
                    bsp_board_led_off(OTA_IMAGE_PRESENT_LED);
                    break;
                }
                else
                {
                    dfu_image_valid = true;
                }

                if (m_stack_started && ZB_JOINED())
                {
                    NRF_LOG_INFO("Insert new Zigbee image to the OTA server.");
                    zb_err_code = ZB_GET_OUT_BUF_DELAYED(insert_ota_file);
                    if (zb_err_code != RET_OK)
                    {
                        NRF_LOG_WARNING("New image not inserted due to lack of Zigbee memory buffers.");
                    }
                }
                else
                {
                    NRF_LOG_INFO("Inserting new Zigbee image postponed. Waiting for the device to join Zigbee network.");
                }

                /* Disconnect from the peer. */
                ret_code_t err_code = ble_dfu_transport_disconnect();
                if (err_code != NRF_SUCCESS)
                {
                    NRF_LOG_ERROR("Unable to disconnect from the BLE DFU peer. Status: %d", err_code);
                }
            }
            else
            {
                NRF_LOG_INFO("New firmware for OTA server downloaded.");
                dfu_image_valid = true;

                if (ble_transport_active)
                {
                    NRF_LOG_INFO("Disconnect from BLE peer.");
                    UNUSED_RETURN_VALUE(app_sched_event_put(NULL, 0, ble_transport_disable));
                }
                else
                {
                    NRF_LOG_INFO("Reset device.");
                    UNUSED_RETURN_VALUE(ZB_SCHEDULE_CALLBACK(reset_ota_server, 0));
                }
            }
            break;

        default:
            NRF_LOG_INFO("Unhandled BLE DFU event: %d", event);
            break;
    }
}

nrf_dfu_result_t nrf_dfu_validation_post_external_app_execute(dfu_init_command_t const * p_init, bool is_trusted)
{
    NRF_LOG_INFO("Executing nrf_dfu_validation_post_external_app_execute\r\n");

    (void)p_init;
    (void)is_trusted;

    if (ota_file_sanity_check(mp_ota_file))
    {
        m_external_app_valid = true;
        NRF_LOG_INFO("Downloaded image is valid.");
        return NRF_DFU_RES_CODE_SUCCESS;
    }
    else
    {
        m_external_app_valid = false;
        NRF_LOG_INFO("Downloaded image is invalid.");
        return NRF_DFU_RES_CODE_INVALID;
    }
}
#endif

void zboss_signal_handler(zb_uint8_t param)
{
    zb_zdo_app_signal_hdr_t  * p_sg_p = NULL;
    zb_zdo_app_signal_type_t   sig    = zb_get_app_signal(param, &p_sg_p);
    zb_ret_t                   status = ZB_GET_APP_SIGNAL_STATUS(param);
    zb_bool_t                  comm_status;

    switch(sig)
    {
        case ZB_ZDO_SIGNAL_DEFAULT_START:
        case ZB_BDB_SIGNAL_DEVICE_FIRST_START:
        case ZB_BDB_SIGNAL_DEVICE_REBOOT:
            if (status == RET_OK)
            {
                NRF_LOG_INFO("Joined network successfully");
                bsp_board_led_on(ZIGBEE_NETWORK_STATE_LED);

#if defined(ZIGBEE_OTA_SERVER_USE_CLI) && (ZIGBEE_OTA_SERVER_USE_CLI == 1)
                UNUSED_RETURN_VALUE(bdb_start_top_level_commissioning(ZB_BDB_NETWORK_STEERING));
#else /* defined(ZIGBEE_OTA_SERVER_USE_CLI) && (ZIGBEE_OTA_SERVER_USE_CLI == 1) */
                m_stack_started = ZB_TRUE;
#endif /* defined(ZIGBEE_OTA_SERVER_USE_CLI) && (ZIGBEE_OTA_SERVER_USE_CLI == 1) */

                /* Look for the zigbee image file header. */
                if (ota_file_sanity_check(mp_ota_file))
                {
#ifdef SOFTDEVICE_PRESENT
                    /* Check if the whole zigbee image was received by the device
                     * before advertising it as a new, valid zigbee image.
                     *
                     * NOTE: Normally checking the bank code value is enough to
                     *       validate image, although there is one exception:
                     *       if the device did not reset between receiving an image
                     *       and joininng the zigbee network, the bank code value is still
                     *       not updated (done only by the bootloader code).
                     *       In such situation it is enough to check m_external_app_valid
                     *       flag value, as it can be set to true only by the DFU, at the post
                     *       validation phase.
                     */
                    if ((!nrf_dfu_validation_valid_external_app()) && (!m_external_app_valid))
                    {
                        NRF_LOG_INFO("DFU validation failed (incorrect bank code). Drop zigbee image.");
                        bsp_board_led_off(OTA_IMAGE_PRESENT_LED);
                        break;
                    }
                    else
#endif
                    {
                        NRF_LOG_INFO("New zigbee image found. Schedule image insertion.");
                        UNUSED_RETURN_VALUE(ZB_SCHEDULE_ALARM(insert_ota_file, param, ZIGBEE_OTA_IMAGE_NOTIFY_DELAY));
                        param = 0;
                    }
                }
                else
                {
                    NRF_LOG_INFO("No zigbee image found inside internal flash.");
                }
            }
            else
            {
                NRF_LOG_ERROR("Failed to join network. Status: %d", status);
                bsp_board_led_off(ZIGBEE_NETWORK_STATE_LED);
                comm_status = bdb_start_top_level_commissioning(ZB_BDB_NETWORK_STEERING);
                ZB_COMM_STATUS_CHECK(comm_status);
            }
            break;

        case ZB_ZDO_SIGNAL_LEAVE:
            if (status == RET_OK)
            {
                bsp_board_led_off(ZIGBEE_NETWORK_STATE_LED);

                zb_zdo_signal_leave_params_t * p_leave_params = ZB_ZDO_SIGNAL_GET_PARAMS(p_sg_p, zb_zdo_signal_leave_params_t);
                NRF_LOG_INFO("Network left. Leave type: %d", p_leave_params->leave_type);
            }
            else
            {
                NRF_LOG_ERROR("Unable to leave network. Status: %d", status);
            }
            break;

#if defined(ZIGBEE_OTA_SERVER_USE_CLI) && (ZIGBEE_OTA_SERVER_USE_CLI == 1)
        case ZB_ZDO_SIGNAL_SKIP_STARTUP:
            m_stack_started = ZB_TRUE;
            break;
#endif /* defined(ZIGBEE_OTA_SERVER_USE_CLI) && (ZIGBEE_OTA_SERVER_USE_CLI == 1) */

        default:
            /* Unhandled signal. For more information see: zb_zdo_app_signal_type_e and zb_ret_e */
            NRF_LOG_INFO("Unhandled signal %d. Status: %d", sig, status);
            break;
    }

    if (param)
    {
        ZB_FREE_BUF_BY_REF(param);
    }
}


int main(void)
{
    zb_ieee_addr_t ieee_addr;
    ret_code_t     ret = NRF_SUCCESS;

    UNUSED_VARIABLE(ret);
    UNUSED_VARIABLE(m_stack_started);

#if defined(ZIGBEE_OTA_SERVER_USE_CLI) && (ZIGBEE_OTA_SERVER_USE_CLI == 1) && ZIGBEE_OTA_SERVER_USE_CLI && defined(APP_USBD_ENABLED) && APP_USBD_ENABLED
    ret = nrf_drv_clock_init();
    APP_ERROR_CHECK(ret);
    nrf_drv_clock_lfclk_request(NULL);
#endif

    /* Initialize timers, logging and LEDs */
    timers_init();
    log_init();
    bsp_board_init(BSP_INIT_LEDS);
    scheduler_init();
    power_driver_init();

#ifdef SOFTDEVICE_PRESENT
    /* Initialize DFU module. */
    UNUSED_RETURN_VALUE(nrf_dfu_settings_init(true));
    UNUSED_RETURN_VALUE(nrf_dfu_req_handler_init(dfu_observer));

    /* Initialize BLE DFU transport and start advertising. */
    ret = ble_dfu_transport_init(dfu_observer);
    APP_ERROR_CHECK(ret);
#endif

    uint32_t bootloader_addr_actual   = BOOTLOADER_ADDRESS;
    uint32_t bootloader_addr_expected = BOOTLOADER_START_ADDR;

    /* Check if bootloader start address is consistent with UICR register contents. */
    if ((bootloader_addr_expected != bootloader_addr_actual) && (bootloader_addr_actual != 0xFFFFFFFF))
    {
        NRF_LOG_ERROR("Incorrect bootloader start address. Set BOOTLOADER_START_ADDR to 0x%x", BOOTLOADER_ADDRESS);
        NRF_LOG_FINAL_FLUSH();
        ASSERT(0);
    }

    /* Sanity check for the OTA Upgrade file */
    mp_ota_file = (ota_upgrade_test_file_t *)(UPGRADE_IMAGE_OFFSET);
    if (!ota_file_sanity_check(mp_ota_file))
    {
#ifndef SOFTDEVICE_PRESENT
        // There is no way to obtain a correct Zigbee OTA firmware - halt.
        for(;;);
#endif
    }

    /* Set ZigBee stack logging level and traffic dump subsystem. */
    ZB_SET_TRACE_LEVEL(ZIGBEE_TRACE_LEVEL);
    ZB_SET_TRACE_MASK(ZIGBEE_TRACE_MASK);
    ZB_SET_TRAF_DUMP_OFF();

    /* Initialize the attributes */
    ota_server_attr_init();

    ZB_INIT("ota_server");

    /* Set device address to the value read from FICR registers. */
    zb_osif_get_ieee_eui64(ieee_addr);
    zb_set_long_address(ieee_addr);

    zb_set_network_router_role(IEEE_CHANNEL_MASK);
    zb_set_max_children(MAX_CHILDREN);
    zigbee_erase_persistent_storage(ERASE_PERSISTENT_CONFIG);
    zb_set_keepalive_timeout(ZB_MILLISECONDS_TO_BEACON_INTERVAL(3000));

    /* Register OTA Client device context (endpoints). */
    ZB_AF_REGISTER_DEVICE_CTX(&ota_upgrade_server_ctx);

    zb_zcl_ota_upgrade_init_server(OTA_ENDPOINT, next_data_ind_cb);

#if defined(ZIGBEE_OTA_SERVER_USE_CLI) && (ZIGBEE_OTA_SERVER_USE_CLI == 1)
    /* Initialize the Zigbee CLI subsystem */
    zb_cli_init(CLI_AGENT_ENDPOINT);

    /* Set the endpoint receive hook */
    ZB_AF_SET_ENDPOINT_HANDLER(CLI_AGENT_ENDPOINT, cli_agent_ep_handler);

    /* Start ZigBee stack. */
    while(1)
    {
        if (m_stack_started)
        {
            zboss_main_loop_iteration();
        }
        app_sched_execute();
        zb_cli_process();
        UNUSED_RETURN_VALUE(NRF_LOG_PROCESS());
    }
#else /* defined(ZIGBEE_OTA_SERVER_USE_CLI) && (ZIGBEE_OTA_SERVER_USE_CLI == 1) */
    zb_ret_t zb_err_code = zboss_start();
    ZB_ERROR_CHECK(zb_err_code);
    while(1)
    {
        zboss_main_loop_iteration();
        app_sched_execute();
        UNUSED_RETURN_VALUE(NRF_LOG_PROCESS());
    }
#endif /* defined(ZIGBEE_OTA_SERVER_USE_CLI) && (ZIGBEE_OTA_SERVER_USE_CLI == 1) */
}
